//==================================================================
//								enemyBow.h
//	弓エネミー
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/09/06	弓エネミー
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "enemy.h"
#include "weapon.h"

//===== クラス定義 =====
class CEnemyBow : public CEnemy
{
public:
	CEnemyBow();
	~CEnemyBow();
	// 仮想関数
	virtual void Update();

private:
	CWeapon *m_pWeapon;
};


