//==================================================================
//								enemyLance.h
//	ランスエネミー
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/08/20	ランスエネミークラスの作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "enemy.h"
#include "weapon.h"

//===== クラス定義 =====
class CEnemyLance : public CEnemy
{
public:
	CEnemyLance();
	~CEnemyLance();
	// 仮想関数
	virtual void Update();

private:
	CWeapon *m_pWeapon;
};


