//==================================================================
//								enemySlim.h
//	スライム
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/08/19	スライムクラスの作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "enemy.h"

//===== クラス定義 =====
class CEnemySlim : public CEnemy
{
public:
	CEnemySlim();
	~CEnemySlim();
	// 仮想関数
	virtual void Update();

private:

};


