//==================================================================
//									movieUI.cpp
//	ムービー中の黒い縁
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/09/08	ムービーUIクラスの作成
//
//===================================================================


//====== インクルード部 ======
#include "movieUI.h"
#include "../sprite.h"
#include "../texture.h"
#include "camera.h"
#include "objectMgr.h"


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===== 静的メンバ =====
CTexture CMovieUI::sm_texture;
bool CMovieUI::m_bDraw = false;



//========================================
//
//	コンストラクタ
//
//========================================
CMovieUI::CMovieUI()
{
	// ポリゴンのパラメータの初期化
	m_transform;
	m_transform.SetSize(Float2{ SCREEN_WIDTH, SCREEN_HEIGHT });

	// スプライトデータ
	m_sprite;

	// レイヤー
	m_enLayer = LAYER::FADE;

	// 表示フラグ
	m_bDraw = false;
}


//========================================
//
//	デストラクタ
//
//========================================
CMovieUI::~CMovieUI()
{

}


//========================================
//
//	初期化
//
//========================================
void CMovieUI::Init()
{
	// テクスチャのロード
	sm_texture.LoadTexture(FILE_PATH"ui/movie.tga");

}


//========================================
//
//	終了処理
//
//========================================
void CMovieUI::Uninit()
{
	// テクスチャの解放
	sm_texture.UnloadTexture();
}


//========================================
//
//	更新
//
//========================================
void CMovieUI::Update()
{


}


//========================================
//
//	描画
//
//========================================
void CMovieUI::Draw()
{
	if (!m_bDraw) return;

	m_sprite.Draw(&m_transform, &sm_texture, false);

}


//========================================
//
//	生成
//
//========================================
CMovieUI* CMovieUI::Create(Float3 pos)
{
	CMovieUI* pBg = CObjectManager::CreateObject<CMovieUI>(pos);

	return pBg;
}


//========================================
//
//	破棄
//
//========================================
void CMovieUI::Destroy()
{
	CObjectManager::DestroyObject(this);
}

