//==================================================================
//								sceneGame.h
//	GM21 ゲームシーン
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/07/18	ゲームシーンクラス作成
//
//===================================================================


//====== インクルード部 ======
#include "sceneGame.h"
#include "sceneTitle.h"
#include "sceneManager.h"
#include "stageManager.h"
#include "experience.h"


#ifdef _WIN32
#include "../input.h"
#include "../Sound.h"
#endif // _WIN32

//===== マクロ定義 =====


//===== グローバル変数 =====


//========================================
//
//	コンストラクタ
//
//========================================
CSceneGame::CSceneGame()
{
	
}


//========================================
//
//	デストラクタ
//
//========================================
CSceneGame::~CSceneGame()
{

}


//========================================
//
//	初期化
//
//========================================
void CSceneGame::Init()
{
	CStageManager::Init();
	CExperience::Init();

}

//========================================
//
//	終了処理
//
//========================================
void CSceneGame::Uninit()
{
	CStageManager::Uninit();
	CExperience::Uninit();

	// サウンド
	//g_pVoice->Stop();

}

//========================================
//
//	全てのオブジェクトの更新
//
//========================================
void CSceneGame::Update()
{
	CStageManager::Update();

#ifdef _WIN32
	/*if (GetKeyRelease(VK_RETURN))
	{
		CSceneManager::SetNextScene(new CSceneTitle());
	}*/

#endif // _WIN32
}


//========================================
//
//	全てのオブジェクトの描画
//
//========================================
void CSceneGame::Draw()
{
	CStageManager::Draw();
}

