//==================================================================
//								stage.h
//	ステージベース
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/08/23	ステージクリアの作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "../main.h"


//===== クラス定義 =====
class CStage
{
public:
	CStage();
	~CStage();

	// 四大処理
	virtual void Init();
	virtual void Uninit();
	virtual void Update();
	virtual void Draw();

private:

};


