//==================================================================
//									stage.h
//	GM21 居合切りのステージ
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/06/12	居合切りのステージ作成(プロトタイプ)
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "../main.h"


//===== 構造体定義 =====



//===== プロトタイプ宣言 =====
void InitStage(void);
void UninitStage(void);
void UpdateStage(void);
void DrawStage(void);


