//==================================================================
//									word.cpp
//	文字列表示
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/08/08	文字列表示クラスの作成
//
//===================================================================


//====== インクルード部 ======
#include "word.h"
#include "../sprite.h"
#include "../texture.h"


//===== マクロ定義 =====


//===== プロトタイプ宣言 =====


//===== グローバル変数 =====


//===== 静的メンバ =====



//========================================
//
//	コンストラクタ
//
//========================================
CWord::CWord()
{
	// ポリゴンのパラメータの初期化
	m_trans;

	// スプライトデータ
	m_sprite;

	m_pTexture = nullptr;
}


//========================================
//
//	デストラクタ
//
//========================================
CWord::~CWord()
{

}


//========================================
//
//	更新
//
//========================================
void CWord::Update()
{


}


//========================================
//
//	描画
//
//========================================
void CWord::Draw(bool bCameara)
{
	m_sprite.Draw(&m_trans, m_pTexture, bCameara);
}


//========================================
//
//	生成
//
//========================================
CWord* CWord::Create(Float3 pos, Float2 size, Float2 texPos, Float2 texSize, Float4 color, CTexture *pTexture)
{
	CWord *pWord = new CWord();
	CTransform *pTrans	= &pWord->m_trans;
	CSprite *pSprite	= &pWord->m_sprite;

	// トランスフォームデータ
	pTrans->SetPos(pos);
	pTrans->SetSize(size);

	// スプライトデータ
	pSprite->SetTexPos(texPos);
	pSprite->SetTexSize(texSize);
	pSprite->SetColor(color);

	// テクスチャ
	pWord->m_pTexture = pTexture;

	return pWord;
}

//========================================
//
//	生成
//
//========================================
CWord* CWord::Create()
{
	return new CWord();;
}



//========================================
//
//	描画
//
//========================================
void CWord::Destroy()
{
	delete this;
}
